<script setup>
import { ref } from "vue";
let panel = ref(null);
const faqData = ref([
  {
    number: 1,
    title: "کالای مورد نظرتان را در سایت می مد چگونه جست و جو کنید؟",
    text: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد کتابهای زیادی در شصت و سه درصد گذشته حال و آینده",
  },
  {
    number: 2,
    title: "کالای مورد نظرتان را در سایت می مد چگونه جست و جو کنید؟",
    text: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد کتابهای زیادی در شصت و سه درصد گذشته حال و آینده",
  },
  {
    number: 3,
    title: "کالای مورد نظرتان را در سایت می مد چگونه جست و جو کنید؟",
    text: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد کتابهای زیادی در شصت و سه درصد گذشته حال و آینده",
  },
  {
    number: 4,
    title: "کالای مورد نظرتان را در سایت می مد چگونه جست و جو کنید؟",
    text: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد کتابهای زیادی در شصت و سه درصد گذشته حال و آینده",
  },
]);
</script>
<template>
  <v-row>
    <v-col md="7" cols="12" class="faq">
      <v-expansion-panels v-model="panel">
        <v-expansion-panel v-for="data in faqData" :key="data.number">
          <v-expansion-panel-title
            ><span class="faqCounter">{{ data.number }}</span
            >{{ data.title }}

            <template v-slot:actions>
              <v-icon class="faqIcon" icon="fi fi-rr-plus-small"> </v-icon>
            </template>
          </v-expansion-panel-title>
          <v-expansion-panel-text> {{ data.text }} </v-expansion-panel-text>
        </v-expansion-panel>
      </v-expansion-panels>
    </v-col>
    <v-col md="5" class="d-md-block d-none">
      <v-img
        src="/assets/images/faq.png"
        style="max-width: 900px"
        width="90%"
        class="mr-10"
      />
    </v-col>
  </v-row>
</template>
 